import random

# Список цитат студентів
_quotes = [
    "я повісився щоб не йти на пару",
    "я не хочу просинатись та йти до медведєвої",
    "що робити коли тебе грузе Голев?",
    "я не хочу робити роботу",
    "мамі своєї покажеш",
    "тобі більше всіх треба?",
    "навіщо ти мене ображаєш? В школі не навчили?",
    "яка пара в мене бізнеси",
    "допомагаємо та не кидаємо в біде",
]
_jokes = [
    "топ 2 знаки зодіаку. 1 - близнюки. 2 - 11 вересня",
    "переходила бабка не на той світ а опинилась на тому",
    "я точно все здам",
    "негри кинули пити й ти зможеш",
    "мені вистачає стипендії на життя",
    "я точно все здам голеву",
]

_adjectives = [
    "страшний",
    "неперевершениий",
    "анімє",
    "засмаглива",
    "аборигенний",
    "смачний",
    "антропометричний",
    "щільний",
    "гейський",
    "ангорський",
    "аґро",
    "няшка",
    "вумен",
    "мен",
    "звільненний",
    "недоторканний",
    "на Бахмут",
    "на Авдіївку",
    "зековський",
    "кліматичний",
]
_nouns = [
    "гей",
    "порося",
    "кішечка",
    "мама",
    "юра",
    "карев",
    "саня",
    "азов",
    "камера",
    "семпай",
    "с-300",
    "крим наш",
    "геноцид",
    "бандера",
    "придатний на війну",
    "чмобік",
    "олех",
    "мобілка",
    "світ",
    "коханий",
]


def generate_custom_name():
    adjective = random.choice(_adjectives)
    noun = random.choice(
        _nouns,
    )
    return f"{adjective} {noun}"


def get_random_joke():
    return random.choice(_jokes)


def get_random_quote():
    return random.choice(_quotes)
